In [1]:
import pandas as pd
import numpy as np

In [2]:
flood = pd.read_csv("C:/Users/go27s/OneDrive/Documents/Udemy/Statistics and Probability/Statistics/kerala_floods.csv")
flood.head()

,SUBDIVISION,YEAR,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,ANNUAL RAINFALL,FLOODS
0,KERALA,1901,28.7,44.7,51.6,160.0,174.7,824.6,743.0,357.5,197.7,266.9,350.8,48.4,3248.6,YES
1,KERALA,1902,6.7,2.6,57.3,83.9,134.5,390.9,1205.0,315.8,491.6,358.4,158.3,121.5,3326.6,YES
2,KERALA,1903,3.2,18.6,3.1,83.6,249.7,558.6,1022.5,420.2,341.8,354.1,157.0,59.0,3271.2,YES
3,KERALA,1904,23.7,3.0,32.2,71.5,235.7,1098.2,725.5,351.8,222.7,328.1,33.9,3.3,3129.7,YES
4,KERALA,1905,1.2,22.3,9.4,105.9,263.3,850.2,520.5,293.6,217.2,383.5,74.4,0.2,2741.6,NO

In [3]:
flood.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 118 entries, 0 to 117
Data columns (total 16 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   SUBDIVISION       118 non-null    object
 1   YEAR              118 non-null    int64
 2   JAN               118 non-null    float64
 3   FEB               118 non-null    float64
 4   MAR               118 non-null    float64
 5   APR               118 non-null    float64
 6   MAY               118 non-null    float64
 7   JUN               118 non-null    float64
 8   JUL               118 non-null    float64
 9   AUG               118 non-null    float64
 10  SEP               118 non-null    float64
 11  OCT               118 non-null    float64
 12  NOV               118 non-null    float64
 13  DEC               118 non-null    float64
 14   ANNUAL RAINFALL  118 non-null    float64
 15  FLOODS            118 non-null    object
dtypes: float64(13), int64(1), object(2)
memory usage: 14.9+ KB

In [4]:
flood.describe(include='object')

       SUBDIVISION FLOODS
count          118    118
unique           2      2
top         KERALA    YES
freq           117     60

In [5]:
flood[['SUBDIVISION', 'FLOODS']].value_counts()

SUBDIVISION  FLOODS
KERALA       YES       60
             NO        57
KERALA       NO         1
dtype: int64

In [6]:
flood.shape

(118, 16)

In [7]:
# check for null values
flood.isnull().any()

SUBDIVISION         False
YEAR                False
JAN                 False
FEB                 False
MAR                 False
APR                 False
MAY                 False
JUN                 False
JUL                 False
AUG                 False
SEP                 False
OCT                 False
NOV                 False
DEC                 False
 ANNUAL RAINFALL    False
FLOODS              False
dtype: bool

# What is the probability of having a rainfall more than 500mm in June, provided it has flooded that year?

In [8]:
# P(A|B) = P(A)*P(B|A)/P(B)
# P(A) - probability of having a rainfall more than 500mm in June
# P(B) - there was a flood

In [9]:
flood.head(2)

,SUBDIVISION,YEAR,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,ANNUAL RAINFALL,FLOODS
0,KERALA,1901,28.7,44.7,51.6,160.0,174.7,824.6,743.0,357.5,197.7,266.9,350.8,48.4,3248.6,YES
1,KERALA,1902,6.7,2.6,57.3,83.9,134.5,390.9,1205.0,315.8,491.6,358.4,158.3,121.5,3326.6,YES

In [10]:
flood['FLOODS'].unique()

array(['YES', 'NO'], dtype=object)

In [11]:
flood['June_more_than_500'] = (flood['JUN'] > 500).astype(int)
flood['Flood'] = flood['FLOODS'].map({'YES': 1, 'NO': 0})
flood.head()

,SUBDIVISION,YEAR,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,ANNUAL RAINFALL,FLOODS,June_more_than_500,Flood
0,KERALA,1901,28.7,44.7,51.6,160.0,174.7,824.6,743.0,357.5,197.7,266.9,350.8,48.4,3248.6,YES,1,1
1,KERALA,1902,6.7,2.6,57.3,83.9,134.5,390.9,1205.0,315.8,491.6,358.4,158.3,121.5,3326.6,YES,0,1
2,KERALA,1903,3.2,18.6,3.1,83.6,249.7,558.6,1022.5,420.2,341.8,354.1,157.0,59.0,3271.2,YES,1,1
3,KERALA,1904,23.7,3.0,32.2,71.5,235.7,1098.2,725.5,351.8,222.7,328.1,33.9,3.3,3129.7,YES,1,1
4,KERALA,1905,1.2,22.3,9.4,105.9,263.3,850.2,520.5,293.6,217.2,383.5,74.4,0.2,2741.6,NO,1,0

In [12]:
data = flood[['YEAR', 'June_more_than_500', 'Flood']]
data

     YEAR  June_more_than_500  Flood
0    1901                   1      1
1    1902                   0      1
2    1903                   1      1
3    1904                   1      1
4    1905                   1      0
..    ...                 ...    ...
113  2014                   0      1
114  2015                   1      0
115  2016                   1      0
116  2017                   0      0
117  2018                   1      1

[118 rows x 3 columns]

In [13]:
pd.crosstab(data['Flood'], data['June_more_than_500'], margins=True)

June_more_than_500   0   1  All
Flood
0                   19  39   58
1                    6  54   60
All                 25  93  118

In [14]:
# P(A|B) = P(A)*P(B|A)/P(B)
# P(A) - probability of having a rainfall more than 500mm in June
# P(B) - there was a flood
# P(B|A) - probability of flood given there was a rainfall

In [36]:
# P(A)
rain = (data['June_more_than_500'] == 1).sum()
p_rain = round(rain/118, 2)
p_rain

0.79

In [37]:
flood = (data['Flood'] == 1).sum()
p_flood = round(flood/118, 2)
p_flood

0.51

In [38]:
# P(B|A)
flood_rain = len(data[(data['Flood'] == 1) & (data['June_more_than_500'] == 1)])
p_flood_rain = round(flood_rain/118, 2)
p_flood_rain

0.46

In [40]:
# P(rainfall|flood) = P(rainfall) * P(flood|rainfall) / P(flood)

p = p_rain * p_flood_rain / p_flood
p

0.7125490196078432

In [16]:
# Probability of rainfall more than 500 in June (marginal probability) --> 93 (June_more_than_500 = 1)

p_500j = 93/118
p_500j

0.788135593220339

In [17]:
# Probability of Flood(marginal probability) --> 60 (Flood = 1)
p_flood = 60/118
p_flood

0.5084745762711864

In [18]:
# Joint Probability --> probability of flood and more than 500mm of rain in June
p_flood_rain = 54/118
p_flood_rain

0.4576271186440678

In [19]:
# Conditional Probability --> probability of flood, given it rained more than 500mm
p = p_flood_rain / p_500j
p

0.5806451612903226